{
  "category": "interior-walls-ceilings",
  "groups": [
    {
      "id": "typical-flaws",
      "label": "Typical Flaws",
      "comments": [
        {
          "id": "preowned-home-typical-flaws",
          "label": "[[Preowned Home Typical Flaws]] Note",
          "type": "note",
          "goesInSummary": false,
          "text": "During the inspection, typical drywall flaws were observed. These may include minor cracks, scuffs, and small holes from household items hung on walls. Such conditions are common in previously owned homes.",
          "tags": ["drywall", "cosmetic", "preowned"],
          "notesToAI": "Use for older homes with expected cosmetic imperfections."
        },
        {
          "id": "new-build-typical-flaws",
          "label": "[[New Build Typical Drywall Flaws]] Note",
          "type": "note",
          "goesInSummary": false,
          "text": "During the inspection of the new construction, typical drywall flaws were noted, including minor visible seams, nail pops, and areas with slight surface imperfections. These are common in new builds as materials settle and cure and do not pose structural concern.",
          "tags": ["drywall", "new build", "cosmetic"],
          "notesToAI": "Use for new construction with normal settling imperfections."
        }
      ]
    },
    {
      "id": "water-staining-damage-leaks",
      "label": "Water Staining, Water Damage, and Leaks",
      "comments": [
        {
          "id": "water-staining-dry-a",
          "label": "[[Water Staining Dry]] Monitor",
          "type": "monitor",
          "goesInSummary": false,
          "text": "An area of water staining was noted at (Interior Location). The area was dry at the time of inspection. Recommend consulting with the current owners for additional information prior to closing. If the leak is still active, we recommend repair or replacement as needed to remedy the leak.",
          "tags": ["water stain", "dry", "interior"],
          "notesToAI": "Use when staining is visible but dry and no active moisture is confirmed."
        },
        {
          "id": "water-staining-dry-b",
          "label": "[[Water Staining Dry]] Monitor",
          "type": "monitor",
          "goesInSummary": false,
          "text": "Water staining was noted at (Interior Location). This area was dry at the time of inspection and the seller should be consulted regarding prior leaks to this area and any repairs that may have been made.",
          "tags": ["water stain", "dry"],
          "notesToAI": "Use when staining suggests past moisture but is currently inactive."
        },
        {
          "id": "water-damage",
          "label": "[[Water Damage]] Monitor / Repair",
          "type": "monitor",
          "goesInSummary": false,
          "text": "Water damage was noted at (Interior Location). Depending on the extent of damage, repairs to finishes may be needed. Monitor for worsening conditions.",
          "tags": ["water damage", "interior"],
          "notesToAI": "Use when deterioration or warping suggests moisture-related damage."
        },
        {
          "id": "active-leak",
          "label": "[[Active Leak]] Repair/Replace",
          "type": "repair",
          "goesInSummary": true,
          "text": "An active water leak was identified affecting the interior finishes at (Interior Location). The presence of moisture was confirmed using both infrared imaging and a moisture meter, indicating elevated moisture levels within materials. This suggests ongoing water intrusion, which could lead to deterioration. Repair or replacement of damaged materials and correction of the source of leakage are recommended.",
          "tags": ["active leak", "water intrusion"],
          "notesToAI": "Use when moisture meter and IR both confirm active moisture."
        },
        {
          "id": "low-quality-water-related",
          "label": "[[Low Quality Interior Finishes (Water Related)]] Note",
          "type": "note",
          "goesInSummary": false,
          "text": "Multiple areas of the interior finishes show signs of water staining or damage, such as discoloration or warping. These issues appear related to ongoing or past water intrusion. Repairs to damaged finishes may be desirable, and the source of moisture should be addressed.",
          "tags": ["water damage", "finish issues"],
          "notesToAI": "Use when moisture has affected multiple areas, even if active leakage is not confirmed."
        }
      ]
    },
    {
      "id": "patching-finish-damage-workmanship",
      "label": "Patching, Finish Damage, and Workmanship",
      "comments": [
        {
          "id": "patching",
          "label": "[[Patching]] Monitor",
          "type": "monitor",
          "goesInSummary": false,
          "text": "Evidence of patching was detected at (Interior Location). This area should be monitored for changes that may indicate an underlying issue.",
          "tags": ["patching", "drywall"],
          "notesToAI": "Use when patched areas appear uneven or recently repaired."
        },
        {
          "id": "finish-damage",
          "label": "[[Finish Damage]] Monitor",
          "type": "monitor",
          "goesInSummary": false,
          "text": "Damage to the interior finish was observed at (Interior Location). Repairs may be desirable for cosmetic or functional reasons.",
          "tags": ["finish damage", "interior"],
          "notesToAI": "Use for dents, gouges, scraping, or cosmetic drywall damage."
        },
        {
          "id": "low-quality-install",
          "label": "[[Low Quality Install]] Note",
          "type": "note",
          "goesInSummary": false,
          "text": "Several interior finishes were observed to have workmanship that appears below standard. Examples include uneven seams, visible gaps, inconsistent paint finishes, or misaligned trim. These issues are primarily cosmetic but may be undesirable.",
          "tags": ["workmanship", "cosmetic"],
          "notesToAI": "Use when flaws appear related to installation quality rather than damage."
        },
        {
          "id": "install-incomplete",
          "label": "[[Install Incomplete]] Note",
          "type": "note",
          "goesInSummary": false,
          "text": "Installation of interior finishes is incomplete at (Interior Location). Further finishing work is recommended.",
          "tags": ["incomplete", "interior finishes"],
          "notesToAI": "Use when trim, drywall finishing, painting, or patching is left incomplete."
        }
      ]
    },
    {
      "id": "cracks-settlement",
      "label": "Cracks and Settlement",
      "comments": [
        {
          "id": "cracks-minor",
          "label": "[[Cracks – Minor]] Monitor",
          "type": "monitor",
          "goesInSummary": false,
          "text": "Minor cracks were noted at (Interior Location). These appear to be due to typical home settlement and are common in many homes.",
          "tags": ["cracks", "minor", "settlement"],
          "notesToAI": "Use for hairline cracks or seasonal cracks."
        },
        {
          "id": "cracks-large",
          "label": "[[Large Cracks]] Monitor / Possible Repair",
          "type": "monitor",
          "goesInSummary": false,
          "text": "Larger-than-typical cracks were noted at (Interior Location). These may indicate underlying structural movement or moisture-related problems. Monitor closely for changes and consider consulting a licensed contractor or structural engineer if they worsen.",
          "tags": ["cracks", "structural"],
          "notesToAI": "Use when cracks exceed typical settlement characteristics."
        }
      ]
    },
    {
      "id": "plaster-older-homes",
      "label": "Plaster (Older Homes)",
      "comments": [
        {
          "id": "plaster-bulging",
          "label": "[[Plaster Bulging]] Monitor",
          "type": "monitor",
          "goesInSummary": false,
          "text": "The plaster shows evidence of bulging at (Interior Location). Repairs may be desirable.",
          "tags": ["plaster", "bulging"],
          "notesToAI": "Use when plaster detaches slightly from lath or bows outward."
        },
        {
          "id": "plaster-weak",
          "label": "[[Plaster Weak]] Monitor",
          "type": "monitor",
          "goesInSummary": false,
          "text": "Plaster finishes show evidence of weakening, as is common in many older homes. Repairs may be desirable.",
          "tags": ["plaster", "weak"],
          "notesToAI": "Use when cracking, crumbling, or hollow sounds suggest weakened plaster."
        }
      ]
    },
    {
      "id": "fire-separation",
      "label": "Fire Separation",
      "comments": [
        {
          "id": "fire-separation",
          "label": "[[Fire Separation]] Repair (Safety)",
          "type": "repair",
          "safety": true,
          "goesInSummary": true,
          "text": "Appropriate fire separation is recommended at (Interior Location). In the event of a fire, this will help prevent fire from spreading quickly to other areas of the home.",
          "tags": ["fire separation", "safety"],
          "notesToAI": "Use when drywall or fire-rated assemblies are missing, altered, or improperly finished."
        }
      ]
    },
    {
      "id": "loose-weak-materials",
      "label": "Loose or Weak Materials",
      "comments": [
        {
          "id": "loose-or-weak",
          "label": "[[Loose or Weak]] Monitor",
          "type": "monitor",
          "goesInSummary": false,
          "text": "Loose or weakened finishes were detected at (Interior Location). Monitor for changes; repairs may be desirable.",
          "tags": ["loose", "weak", "interior"],
          "notesToAI": "Use when material gives under pressure or is starting to detach."
        }
      ]
    },
    {
      "id": "mold-organic-growth",
      "label": "Mold / Organic Growth",
      "comments": [
        {
          "id": "mold-visible",
          "label": "[[Mold Visible]] Repair",
          "type": "repair",
          "goesInSummary": true,
          "text": "What appears to be organic growth resembling mold was observed at (location). Recommend further testing to identify the substance and determine the scope of cleanup needed.",
          "tags": ["mold", "organic growth"],
          "notesToAI": "Use when discoloration or growth suggests fungal activity, but avoid confirming mold without testing."
        }
      ]
    },
    {
      "id": "popcorn-ceilings-ghosting",
      "label": "Popcorn Ceilings and Ghosting",
      "comments": [
        {
          "id": "popcorn-ceiling",
          "label": "[[Popcorn Ceiling]] Monitor",
          "type": "monitor",
          "goesInSummary": false,
          "text": "Textured or \"popcorn\" ceiling material was visible at (location). Asbestos testing is beyond the scope of this inspection. (This material was widely used between ~1945 and early 1990s; asbestos use in ceilings was banned in 1973, but existing stock was used afterward.)",
          "tags": ["popcorn ceiling", "asbestos"],
          "notesToAI": "Use for popcorn ceilings without making claims of asbestos content."
        },
        {
          "id": "ghosting",
          "label": "[[Ghosting]] Monitor",
          "type": "monitor",
          "goesInSummary": false,
          "text": "Ghosting on drywall ceilings was noted at (location). This refers to visible, shadow-like marks or lines that follow framing members. It is typically caused by temperature differences, moisture, or soot accumulation. This is primarily cosmetic but may indicate humidity or ventilation issues.",
          "tags": ["ghosting", "cosmetic"],
          "notesToAI": "Use when streaks align with studs or ceiling joists, especially in humid areas."
        }
      ]
    }
  ]
}
